In [6]:
import pandas as pd

import numpy as np



# Create sample e-commerce data

data = {

 'Date': pd.date_range(start='2023-01-01', end='2023-03-31', freq='D'),

 'Product': np.random.choice(['A', 'B', 'C'], size=90),

 'Category': np.random.choice(['Electronics', 'Clothing', 'Home'], size=90),

 'Sales': np.random.randint(100, 1000, size=90),

 'Quantity': np.random.randint(1, 50, size=90)

}



df = pd.DataFrame(data)

df

         Date Product     Category  Sales  Quantity
0  2023-01-01       A         Home    703        30
1  2023-01-02       A     Clothing    961        39
2  2023-01-03       B         Home    371        36
3  2023-01-04       A         Home    225        33
4  2023-01-05       A         Home    108        17
..        ...     ...          ...    ...       ...
85 2023-03-27       C  Electronics    966         2
86 2023-03-28       A  Electronics    168         6
87 2023-03-29       A  Electronics    733        13
88 2023-03-30       A         Home    479        22
89 2023-03-31       B     Clothing    239        35

[90 rows x 5 columns]

## Task 1: Create a Pivot Table of Total Sales by Product and Category

In [7]:
# Pivot table for total sales by Product and Category
pivot_table = df.pivot_table(values='Sales', index='Product', columns='Category', aggfunc='sum', fill_value=0)
print("Pivot Table:\n", pivot_table)

Pivot Table:
 Category  Clothing  Electronics  Home
Product
A             4014         3835  8236
B             4506         3436  5572
C             3216         8708  8328

## Task 2: Melt the Pivot Table to Long Format

In [8]:
# Melt the pivot table
melted_df = pivot_table.reset_index().melt(id_vars='Product', var_name='Category', value_name='Total_Sales')
print("\nMelted DataFrame:\n", melted_df)

Melted DataFrame:
   Product     Category  Total_Sales
0       A     Clothing         4014
1       B     Clothing         4506
2       C     Clothing         3216
3       A  Electronics         3835
4       B  Electronics         3436
5       C  Electronics         8708
6       A         Home         8236
7       B         Home         5572
8       C         Home         8328

## Task 3: Stack the Melted DataFrame to Create a Multi-Index

In [9]:
# Set Product and Category as MultiIndex
stacked_df = melted_df.set_index(['Product', 'Category']).stack()
print("\nStacked DataFrame:\n", stacked_df)

Stacked DataFrame:
 Product  Category
A        Clothing     Total_Sales    4014
B        Clothing     Total_Sales    4506
C        Clothing     Total_Sales    3216
A        Electronics  Total_Sales    3835
B        Electronics  Total_Sales    3436
C        Electronics  Total_Sales    8708
A        Home         Total_Sales    8236
B        Home         Total_Sales    5572
C        Home         Total_Sales    8328
dtype: int64

## Task 4: Unstack the Final Result to Return to the Original Pivot Table Format

In [11]:
# Unstack the multi-index DataFrame to return to the original pivot table format
unstacked_df = stacked_df.unstack(level='Category')
print("\nUnstacked DataFrame (Back to Pivot Table):\n", unstacked_df)

Unstacked DataFrame (Back to Pivot Table):
 Category             Clothing  Electronics  Home
Product
A       Total_Sales      4014         3835  8236
B       Total_Sales      4506         3436  5572
C       Total_Sales      3216         8708  8328